# Create and Access SQLite database using Python

<p>SQLite is a software library that implements a self-contained, serverless, zero-configuration, transactional SQL database engine. SQLite is the most widely deployed SQL database engine in the world.</p>

In [1]:
import sqlite3
import os

## Task 1: Create database using SQLite

In [2]:
dir_path = os.path.join(".", "data")
db_name = os.path.join(dir_path, "example.db")

conn = sqlite3.connect(db_name)

<p>Cursor class is an instance using which you can invoke methods that execute SQLite statements, fetch data from the result sets of the queries. You can create Cursor object using the cursor() method of the Connection object/class.</p>

In [3]:
curser_obj = conn.cursor()

## Task 2: Create a table in the database

<p>In this step we will create a table in the database with following details:</p>

<table style="border-collapse: collapse; border: 1px solid; text-align: center;">
    <thead>
    <tr>
        <th style="border: 1px solid; text-align: center;">COLUMN NAME</th>
        <th style="border: 1px solid; text-align: center;">DATA TYPE</th>
        <th style="border: 1px solid; text-align: center;">NULLABLE</th>
    </tr>
    </thead>
    <tbody>
    <tr>
        <td style="border: 1px solid; text-align: center;">ID</td>
        <td style="border: 1px solid; text-align: center;">INTEGER</td>
        <td style="border: 1px solid; text-align: center;">N</td>
    </tr>
    <tr>
        <td style="border: 1px solid; text-align: center;">FNAME</td>
        <td style="border: 1px solid; text-align: center;">VARCHAR</td>
        <td style="border: 1px solid; text-align: center;">Y</td>
    </tr>
    <tr>
        <td style="border: 1px solid; text-align: center;">LNAME</td>
        <td style="border: 1px solid; text-align: center;">VARCHAR</td>
        <td style="border: 1px solid; text-align: center;">Y</td>
    </tr>
    <tr>
        <td style="border: 1px solid; text-align: center;">CITY</td>
        <td style="border: 1px solid; text-align: center;">VARCHAR</td>
        <td style="border: 1px solid; text-align: center;">Y</td>
    </tr>
    <tr>
        <td style="border: 1px solid; text-align: center;">CCODE</td>
        <td style="border: 1px solid; text-align: center;">CHARACTER</td>
        <td style="border: 1px solid; text-align: center;">Y</td>
    </tr>
    </tbody>
</table>

<p>Before creating a table, let's first check if the table already exists or not. To drop the table from a database, use the <b>DROP</b> query. A cursor is an object that helps execute the query and fetch the records from the database.</p>

In [4]:
curser_obj.execute("DROP TABLE IF EXISTS example_table")

### Don't worry if you get this error

<p>If you see an exception/error similar to the following, indicating that <code>example_table</code> is an undefined name, that's okay. It just implies that the <code>example_table</code> table does not exist in the table - which would be the case if you had not created it previously.</p>
<p><strong>Exception: SQL0204N "example.example_table" is an undefined name.  SQLSTATE=42704 SQLCODE=-204</strong></p>

In [5]:
table = """
CREATE TABLE IF NOT EXISTS example_table (
    ID INTEGER PRIMARY KEY NOT NULL,
    FNAME VARCHAR(20),
    LNAME VARCHAR(20),
    CITY VARCHAR(20),
    CCODE CHAR(2)
);
"""

curser_obj.execute(table)

print("Table is ready.")

Table is ready.

## Task 3: Insert data into the table

<p>In this step we will insert some rows of data into the table.</p>
<p>The <code>example_table</code> table we created in the previous step contains 3 rows of data:</p>
<table style="border-collapse: collapse; border: 1px solid; text-align: left;">
    <thead>
    <tr>
        <th style="border: 1px solid; text-align: left;">ID<br /><small>INTEGER</small></th>
        <th style="border: 1px solid; text-align: left;">FNAME<br /><small>VARCHAR(20)</small></th>
        <th style="border: 1px solid; text-align: left;">LNAME<br /><small>VARCHAR(20)</small></th>
        <th style="border: 1px solid; text-align: left;">CITY<br /><small>VARCHAR(20)</small></th>
        <th style="border: 1px solid; text-align: left;">CCODE<br /><small>CHARACTER(2)</small></th>
    </tr>
    </thead>
    <tbody>
    <tr>
        <td style="border: 1px solid; text-align: left;">1</td>
        <td style="border: 1px solid; text-align: left;">Rav</td>
        <td style="border: 1px solid; text-align: left;">Ahuja</td>
        <td style="border: 1px solid; text-align: left;">TORONTO</td>
        <td style="border: 1px solid; text-align: left;">CA</td>
    </tr>
    <tr>
        <td style="border: 1px solid; text-align: left;">2</td>
        <td style="border: 1px solid; text-align: left;">Raul</td>
        <td style="border: 1px solid; text-align: left;">Chong</td>
        <td style="border: 1px solid; text-align: left;">Markham</td>
        <td style="border: 1px solid; text-align: left;">CA</td>
    </tr>
    <tr>
        <td style="border: 1px solid; text-align: left;">3</td>
        <td style="border: 1px solid; text-align: left;">Hima</td>
        <td style="border: 1px solid; text-align: left;">Vasudevan</td>
        <td style="border: 1px solid; text-align: left;">Chicago</td>
        <td style="border: 1px solid; text-align: left;">US</td>
    </tr>
    </tbody>
</table>
<p>We will start by inserting just the first row of data (i.e. for instructor Rav Ahuja)</p>

In [6]:
curser_obj.execute("INSERT INTO example_table VALUES (1, 'Rav', 'Ahuja', 'TORONTO', 'CA');")

<p>The output you will get something like <strong>sqlite3.Cursor at 0x2093d3727c0</strong> which means mySql database has sqlite3.Cursor object at 0x2093d3727c0 as output in table. But you may get the different number.</p>
<p>Now use a single query to insert the remaining two rows of data.</p>

In [7]:
curser_obj.execute("INSERT INTO example_table VALUES (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US');")

## Task 4: Query data in the table

<p>In this step we will retrieve data we inserted into the <code>example_table</code> table.</p>

In [8]:
# fetch all row
statement = "SELECT * FROM example_table;"
curser_obj.execute(statement)

print("All the data was shown below.")
output = curser_obj.fetchall()
for row in output:
    print(row)

All the data was shown below.
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [9]:
# fetch a few rows
statement = "SELECT * FROM example_table;"
curser_obj.execute(statement)

print("The first 2 rows of the data was shown below.")
output = curser_obj.fetchmany(2)
for row in output:
    print(row)

The first 2 rows of the data was shown below.
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [10]:
# fetch only `FNAME` from the table
statement = "SELECT `FNAME` FROM example_table;"
curser_obj.execute(statement)

print("'FNAME' data was shown below.")
output = curser_obj.fetchall()
for row in output:
    print(row)

'FNAME' data was shown below.
('Rav',)
('Raul',)
('Hima',)

<p><strong>Bonus: now write and execute an update statement that changes the Rav's CITY to MOOSETOWN.</strong></p>

In [11]:
update = "UPDATE example_table SET `CITY`='MOOSETOWN' WHERE `FNAME`='Rav';"
curser_obj.execute(update)

statement = "SELECT * FROM example_table;"
curser_obj.execute(statement)

print("All the data was shown below.")
output = curser_obj.fetchall()
for row in output:
    print(row)

All the data was shown below.
(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

## Task 5: Retrieve data into Pandas

<p>In this step we will retrieve the contents of the <code>example_table</code> table into a Pandas dataframe.</p>

In [12]:
import pandas as pd

In [13]:
df = pd.read_sql_query("SELECT * FROM example_table;", conn)
df

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [14]:
# print just the LNAME for first row in the pandas data frame
df.LNAME[0]

'Ahuja'

<p>Once the data is in a Pandas dataframe, you can do the typical pandas operations on it.</p>
<p>For example, you can use the shape method to see how many rows and columns are in the dataframe.</p>

In [15]:
df.shape

(3, 5)

## Task 6: Close the Connection

<p>We free all resources by closing the connection. Remember that it is always important to close connections so that we can avoid unused connections taking up resources.</p>

In [16]:
conn.close()

****
This is the end of the file.
****